<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Candidate;

class CandidateSeeder extends Seeder
{
    public function run()
    {
        $candidates = [

            [
                'name' => 'អ្នកស្រី ស៊ុ សាម៉ុន',
                'meta' => 'UPWD, ភ្នំពេញ',
                'photo' => '/voting/photo_2025-12-05_08-39-07.jpg',
                'bio'  => 'បច្ចុប្បន្នជា នាយិកាប្រតិបត្ដិ អង្គការអភិវឌ្ឍន៍ស្ដ្រីក្រីក្រក្នុងទីក្រុង (UPWD) ដែលមានស្នាក់ការនៅភ្នំពេញ។ បំរើការងារក្នុងវិស័យអង្គការសង្គមស៊ីវិលតាំងពីឆ្នាំ២០០០ ជាពិសេសពាក់ព័ន្ធការងារលំនៅដ្ឋាននៅតំបន់ទីក្រុង ព្រមទាំងមានជំនាញផ្សេងៗក្នុងការសម្របសម្រួលនិងការកៀងគធនធាន ហិរញ្ញវត្តុ ដឹកនាំនិងការគ្រប់គ្រង ក៏ដូចជាចូលរួមជាក្រុមប្រឹក្សាភិបាលក្នុងអង្គការដៃគូផ្សេៗ។ ',
            ],

            [
                'name' => 'កញ្ញា ឡី ស្រីម៉ុច',
                'meta' => 'CEDT, ភ្នំពេញ',
                'photo' => '/voting/photo_2025-12-05_08-39-43.jpg',
                'bio'  => ' បច្ចុប្បន្នជា នាយិកាប្រតិបត្តិ អង្គការក្រុមការងារអភិវឌ្ឍនិងពង្រឹងសហគមន៍(CEDT)ដែលមានស្នាក់ការនៅភ្នំពេញ។ បំរើការងារក្នុងវិស័យសង្គមស៊ីវិលតាំងពីឆ្នាំ២០១២ ពាក់ព័ន្ធការពង្រឹងសមត្ថភាពសហគមន៍ទីក្រុង និងជនបទ អភិបាលកិច្ចមូលដ្ឋាន និង  ដីធ្លី ការចូលរួមសហគមន៍ ការចងក្រងឯកសារ  ការគ្រប់គ្រងធនធានធម្មជាតិ ការតាំងទីលំនៅសហគមន៍សំណង់បណ្តោះអាសន្ន និងជនជាតិដើមភាគតិច។',
            ],

            [
                'name' => 'លោក​ ម៉េង ហាក់វិច្ឆ័យ',
                'meta' => 'MPC, ស្រែអំបិល – កោះកុង',
                'photo' => '/voting/photo_2025-12-05_08-39-24.jpg',
                'bio'  => 'បច្ចុប្បន្នជា នាយកប្រតិបត្ដិ អង្គការមជ្ឍមណ្ឌលម្លប់ព្រហ្មវិហារធម៌(MPC) ដែលមានស្នាក់ការខេត្តកោះកុង។ បំរើការងារ ក្នុងវិស័យអង្គការសង្គមស៊ីវិលឆ្នាំ២០០២ ជានាយកប្រតិបត្តិ ដែលពាក់ព័ន្ធការងារគ្រប់គ្រងធនធានធម្មជាតិ និងជលផល ការប្រែប្រួលអាកាសធាតុ និងសេដ្ឋកិច្ចសហគមន៍ ព្រមទាំងមានជំនាញក្នុងការដឹកនាំ គ្រប់គ្រង សម្របសម្រួល ការសរសេរគម្រោង និងកៀរគរធនធាន ជាដើម។ ',
            ],

            [
                'name' => 'កញ្ញា ជុយ វួចអេង',
                'meta' => 'DPA, ភ្នំពេញ',
                'photo' => '/voting/photo_2025-12-05_08-39-50.jpg',
                'bio'  => 'បច្ចុប្បន្នជា អ្នកសម្របសម្រួលគម្រោងនិងលេខា  ធិការដ្ឋាន បណ្តាញឧស្សាហកម្មនីសារណកម្ម នៃអង្គការអភិវឌ្ឍន៍ និងភាពជាដៃគូក្នុងសកម្មភាព (DPA) ដែលមានស្នាក់ការនៅភ្នំពេញ។   បំរើការងារក្នុងវិស័យអង្គការសង្គមស៊ីវិលតាំងពីឆ្នាំ២០២៤ ពាក់ព័ន្ធឧស្សាហកម្មនីសារណកម្ម ធនធានធម្មជាតិ ព្រមទាំងមានជំនាញក្នុងការគ្រប់គ្រង សម្របសម្រួល និងការចរចា ជាដើម។ ',
            ],

            [
                'name' => 'លោក ផន សុធារ៉ា',
                'meta' => 'HA, រតនគិរី',
                'photo' => '/voting/photo_2025-12-05_08-39-29.jpg',
                'bio'  => 'បច្ចុប្បន្នជា ប្រធាន អង្គការសមាគមខ្មែរលើ (HA) ដែលមានស្នាក់ការខេត្តរតនគីរី។ បំរើការងារក្នុងវិស័យអង្គការសង្គមស៊ីវិលតាំងពីឆ្នាំ២០១០ ដែលពាក់ព័ន្ធសិទ្ធិជនជាតិដើមភាគតិចនិងអភិបាលកិច្ចដីធ្លី ព្រមទាំងមានជំនាញផ្សេងៗក្នុងការសម្របសម្រួល និងការគ្រប់គ្រងគម្រោង សរសេររបាយការណ៍និងកៀរគរធនធាន ទំនាក់ទំនងនិងដោះស្រាយទំនាស់ និងការតស៊ូមតិ។ ',
            ],

            [
                'name' => 'អ្នកស្រី ព្រី ផល្លីភួង',
                'meta' => 'BCV, ភ្នំពេញ',
                'photo' => '/voting/photo_2025-12-05_08-40-00.jpg',
                'bio'  => 'បច្ចុប្បន្នជា នាយិកាប្រតិបត្ដិ អង្គការអភិវឌ្ឍន៍    សំលេងសហគមន៍ (BCV) ដែលមានស្នាក់ការនៅភ្នំពេញ។ បំរើការងារក្នុងវិស័យអង្គការសង្គមស៊ីវិលតាំងពីឆ្នាំ២០០០ ដែលពាក់ព័ន្ធអភិបាលកិច្ចដីធ្លី ធនធានធម្មជាតិ ការតស៊ូមតិជាមួយស្រី្ត និងយុវជន ការប្រែប្រួលអាកាសធាតុ រេដបូក និងសិទ្ធិជនជាតិដើមភាគតិច ព្រមទាំងមានជំនាញក្នុងការកសាងសមត្ថភាព ការគ្រប់គ្រងទូទៅ និងប្រព័ន្ធផ្សព្វផ្សាយ។',
            ],

            [
                'name' => 'លោក សុខ សុខុម',
                'meta' => 'CNRO, ព្រះសីហនុ',
                'photo' => '/voting/photo_2025-12-05_08-39-34.jpg',
                'bio'  => 'បច្ចុប្បន្នជា នាយកប្រតិបត្ដិ អង្គការស្រលាញ់ធនធានធម្មជាតិ (CNRO) ដែលមានស្នាក់ការខេត្តព្រះសីហនុ។          បំរើការងារក្នុងវិស័យអង្គការសង្គមស៊ីវិលតាំងពីឆ្នាំ២០០២ ជានាយកប្រតិបត្តិ ដែលពាក់ព័ន្ធការងារគ្រប់គ្រងធនធានធម្មជាតិ និងជលផល   ដីធ្លី ការប្រែប្រួលអាកាសធាតុ និងសេដ្ឋកិច្ចសហគមន៍ ព្រមទាំងមានជំនាញក្នុងការសម្របសម្រួល ការដឹកនាំ ការតស៊ូមតិ និងកៀរគរធនធាន ជាដើម។ ',
            ],

            [
                'name' => 'លោក ប៉ឹក សោភណ',
                'meta' => 'PHK, ភ្នំពេញ',
                'photo' => '/voting/photo_2025-12-05_08-40-06.jpg',
                'bio'  => 'បច្ចុប្បន្នជា នាយកប្រតិបត្ដិ អង្គការពន្លកខ្មែរ (PHK) ដែលមានស្នាក់ការខេត្តព្រះវិហារ។ បំរើការងារក្នុងវិស័យអង្គការសង្គមស៊ីវិលតាំងពីឆ្នាំ២០០៦ ដែលពាក់ព័ន្ធនឹងយុវជន ការងារដីធ្លី និងគ្រប់គ្រងធនធានធម្មជាតិ បរិស្ថាន ព្រៃឈើ សិទ្ធិជនជាតិដើមភាគតិច សេដ្ឋកិច្ចសហគមន៍ និងការងារតស៊ូមតិ ព្រមទាំងមានជំនាញគ្រប់គ្រងទូទៅ និងសម្របសម្រួលដោះស្រាយទំនាស់ក្រៅប្រព័ន្ធ។',
            ],
        ];

        foreach ($candidates as $c) {
            Candidate::create($c);
        }
    }
}
